hparracho/Xarmlib/external/FSL/fsl_mkv44f16_cmsis.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source
{
    kDmaRequestMux0Disable          = 0|0x100U,    /**< DMAMUX TriggerDisabled. */
    kDmaRequestMux0Reserved1        = 1|0x100U,    /**< Reserved1 */
    kDmaRequestMux0UART0Rx          = 2|0x100U,    /**< UART0 receive complete */
    kDmaRequestMux0UART0Tx          = 3|0x100U,    /**< UART0 transmit complete */
    kDmaRequestMux0UART1Rx          = 4|0x100U,    /**< UART1 receive complete */
    kDmaRequestMux0UART1Tx          = 5|0x100U,    /**< UART1 transmit complete */
    kDmaRequestMux0PWMA0WR          = 6|0x100U,    /**< PWMA submodule 0 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA1WR          = 7|0x100U,    /**< PWMA submodule 1 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA2WR          = 8|0x100U,    /**< PWMA submodule 2 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA3WR          = 9|0x100U,    /**< PWMA submodule 3 write request on beginning of reload cycle */
    kDmaRequestMux0PWMA0CP          = 10|0x100U,   /**< PWMA submodule 0 read request on capture FIFO marker */
    kDmaRequestMux0PWMA1CP          = 11|0x100U,   /**< PWMA submodule 1 read request on capture FIFO marker */
    kDmaRequestMux0PWMA2CP          = 12|0x100U,   /**< PWMA submodule 2 read request on capture FIFO marker */
    kDmaRequestMux0PWMA3CP          = 13|0x100U,   /**< PWMA submodule 3 read request on capture FIFO marker */
    kDmaRequestMux0CAN0Rx           = 14|0x100U,   /**< CAN0 reach receiever mailbox level */
    kDmaRequestMux0CAN1Rx           = 15|0x100U,   /**< CAN1 reach receiever mailbox level */
    kDmaRequestMux0SPI0Rx           = 16|0x100U,   /**< SPI0 receive complete */
    kDmaRequestMux0SPI0Tx           = 17|0x100U,   /**< SPI0 transmit complete */
    kDmaRequestMux0XBARAOut0        = 18|0x100U,   /**< XBARA output 0 */
    kDmaRequestMux0XBARAOut1        = 19|0x100U,   /**< XBARA output 1 */
    kDmaRequestMux0XBARAOut2        = 20|0x100U,   /**< XBARA output 2 */
    kDmaRequestMux0XBARAOut3        = 21|0x100U,   /**< XBARA output 3 */
    kDmaRequestMux0I2C0             = 22|0x100U,   /**< I2C0 transmission complete */
    kDmaRequestMux0Reserved23       = 23|0x100U,   /**< Reserved23 */
    kDmaRequestMux0Reserved24       = 24|0x100U,   /**< Reserved24 */
    kDmaRequestMux0Reserved25       = 25|0x100U,   /**< Reserved25 */
    kDmaRequestMux0Reserved26       = 26|0x100U,   /**< Reserved26 */
    kDmaRequestMux0Reserved27       = 27|0x100U,   /**< Reserved27 */
    kDmaRequestMux0Reserved28       = 28|0x100U,   /**< Reserved28 */
    kDmaRequestMux0Reserved29       = 29|0x100U,   /**< Reserved29 */
    kDmaRequestMux0Reserved30       = 30|0x100U,   /**< Reserved30 */
    kDmaRequestMux0Reserved31       = 31|0x100U,   /**< Reserved31 */
    kDmaRequestMux0Reserved32       = 32|0x100U,   /**< Reserved32 */
    kDmaRequestMux0Reserved33       = 33|0x100U,   /**< Reserved33 */
    kDmaRequestMux0CMP3             = 34|0x100U,   /**< CMP3 output */
    kDmaRequestMux0Reserved35       = 35|0x100U,   /**< Reserved35 */
    kDmaRequestMux0Reserved36       = 36|0x100U,   /**< Reserved36 */
    kDmaRequestMux0Reserved37       = 37|0x100U,   /**< Reserved37 */
    kDmaRequestMux0Reserved38       = 38|0x100U,   /**< Reserved38 */
    kDmaRequestMux0Reserved39       = 39|0x100U,   /**< Reserved39 */
    kDmaRequestMux0ADCA             = 40|0x100U,   /**< ADC converter A end of scan */
    kDmaRequestMux0ADCB             = 41|0x100U,   /**< ADC converter B end of scan */
    kDmaRequestMux0CMP0             = 42|0x100U,   /**< CMP0 output */
    kDmaRequestMux0CMP1             = 43|0x100U,   /**< CMP1 output */
    kDmaRequestMux0CMP2             = 44|0x100U,   /**< CMP2 output */
    kDmaRequestMux0DAC0             = 45|0x100U,   /**< DAC0 buffer pointer reaches upper or lower limit */
    kDmaRequestMux0Reserved46       = 46|0x100U,   /**< Reserved46 */
    kDmaRequestMux0PDB0             = 47|0x100U,   /**< PDB0 channel 0 output trigger */
    kDmaRequestMux0PDB1             = 48|0x100U,   /**< PDB1 channel 0 output trigger */
    kDmaRequestMux0PortA            = 49|0x100U,   /**< PORTA rising, falling or both edges */
    kDmaRequestMux0PortB            = 50|0x100U,   /**< PORTB rising, falling or both edges */
    kDmaRequestMux0PortC            = 51|0x100U,   /**< PORTC rising, falling or both edges */
    kDmaRequestMux0PortD            = 52|0x100U,   /**< PORTD rising, falling or both edges */
    kDmaRequestMux0PortE            = 53|0x100U,   /**< PORTE rising, falling or both edges */
    kDmaRequestMux0Reserved54       = 54|0x100U,   /**< Reserved54 */
    kDmaRequestMux0Reserved55       = 55|0x100U,   /**< Reserved55 */
    kDmaRequestMux0Reserved56       = 56|0x100U,   /**< Reserved56 */
    kDmaRequestMux0Reserved57       = 57|0x100U,   /**< Reserved57 */
    kDmaRequestMux0AlwaysOn58       = 58|0x100U,   /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn59       = 59|0x100U,   /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn60       = 60|0x100U,   /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn61       = 61|0x100U,   /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn62       = 62|0x100U,   /**< DMAMUX Always Enabled slot. */
    kDmaRequestMux0AlwaysOn63       = 63|0x100U,   /**< DMAMUX Always Enabled slot. */
} dma_request_source_t;

/* @} */

typedef enum _xbar_input_signal
{
    kXBARA_InputVss                 = 0|0x100U,    /**< Logic zero output assigned to XBARA_IN0 input. */
    kXBARA_InputVdd                 = 1|0x100U,    /**< Logic one output assigned to XBARA_IN1 input. */
    kXBARA_InputXbarIn2             = 2|0x100U,    /**< XBARIN2 input pin output assigned to XBARA_IN2 input. */
    kXBARA_InputXbarIn3             = 3|0x100U,    /**< XBARIN3 input pin output assigned to XBARA_IN3 input. */
    kXBARA_InputXbarIn4             = 4|0x100U,    /**< XBARIN4 input pin output assigned to XBARA_IN4 input. */
    kXBARA_InputXbarIn5             = 5|0x100U,    /**< XBARIN5 input pin output assigned to XBARA_IN5 input. */
    kXBARA_InputXbarIn6             = 6|0x100U,    /**< XBARIN6 input pin output assigned to XBARA_IN6 input. */
    kXBARA_InputXbarIn7             = 7|0x100U,    /**< XBARIN7 input pin output assigned to XBARA_IN7 input. */
    kXBARA_InputXbarIn8             = 8|0x100U,    /**< XBARIN8 input pin output assigned to XBARA_IN8 input. */
    kXBARA_InputXbarIn9             = 9|0x100U,    /**< XBARIN9 input pin output assigned to XBARA_IN9 input. */
    kXBARA_InputXbarIn10            = 10|0x100U,   /**< XBARIN10 input pin output assigned to XBARA_IN10 input. */
    kXBARA_InputXbarIn11            = 11|0x100U,   /**< XBARIN11 input pin output assigned to XBARA_IN11 input. */
    kXBARA_InputCmp0Output          = 12|0x100U,   /**< CMP0 Output output assigned to XBARA_IN12 input. */
    kXBARA_InputCmp1Output          = 13|0x100U,   /**< CMP1 Output output assigned to XBARA_IN13 input. */
    kXBARA_InputCmp2Output          = 14|0x100U,   /**< CMP2 Output output assigned to XBARA_IN14 input. */
    kXBARA_InputCmp3Output          = 15|0x100U,   /**< CMP3 Output output assigned to XBARA_IN15 input. */
    kXBARA_InputRESERVED16          = 16|0x100U,   /**< XBARA_IN16 input is reserved. */
    kXBARA_InputRESERVED17          = 17|0x100U,   /**< XBARA_IN17 input is reserved. */
    kXBARA_InputRESERVED18          = 18|0x100U,   /**< XBARA_IN18 input is reserved. */
    kXBARA_InputRESERVED19          = 19|0x100U,   /**< XBARA_IN19 input is reserved. */
    kXBARA_InputPwm0Trg0            = 20|0x100U,   /**< PWMA channel 0 trigger 0 output assigned to XBARA_IN20 input. */
    kXBARA_InputPwm0Trg1            = 21|0x100U,   /**< PWMA channel 0 trigger 1 output assigned to XBARA_IN21 input. */
    kXBARA_InputPwm1Trg0            = 22|0x100U,   /**< PWMA channel 1 trigger 0 output assigned to XBARA_IN22 input. */
    kXBARA_InputPwm1Trg1            = 23|0x100U,   /**< PWMA channel 1 trigger 1 output assigned to XBARA_IN23 input. */
    kXBARA_InputPwm2Trg0            = 24|0x100U,   /**< PWMA channel 2 trigger 0 output assigned to XBARA_IN24 input. */
    kXBARA_InputPwm2Trg1            = 25|0x100U,   /**< PWMA channel 2 trigger 1 output assigned to XBARA_IN25 input. */
    kXBARA_InputPwm3Trg0            = 26|0x100U,   /**< PWMA channel 3 trigger 0 output assigned to XBARA_IN26 input. */
    kXBARA_InputPwm3Trg1            = 27|0x100U,   /**< PWMA channel 3 trigger 1 output assigned to XBARA_IN27 input. */
    kXBARA_InputRESERVED28          = 28|0x100U,   /**< XBARA_IN28 input is reserved. */
    kXBARA_InputPdb0Ch0Output       = 29|0x100U,   /**< PDB0 channel 0 output trigger output assigned to XBARA_IN29 input. */
    kXBARA_InputRESERVED30          = 30|0x100U,   /**< XBARA_IN30 input is reserved. */
    kXBARA_InputPdb1Ch0Output       = 31|0x100U,   /**< PDB1 channel 0 output trigger output assigned to XBARA_IN31 input. */
    kXBARA_InputRESERVED32          = 32|0x100U,   /**< XBARA_IN32 input is reserved. */
    kXBARA_InputAdcAEs              = 33|0x100U,   /**< ADC converter A end of scan output assigned to XBARA_IN33 input. */
    kXBARA_InputRESERVED34          = 34|0x100U,   /**< XBARA_IN34 input is reserved. */
    kXBARA_InputAdcBEs              = 35|0x100U,   /**< ADC converter B end of scan output assigned to XBARA_IN35 input. */
    kXBARA_InputRESERVED36          = 36|0x100U,   /**< XBARA_IN36 input is reserved. */
    kXBARA_InputRESERVED37          = 37|0x100U,   /**< XBARA_IN37 input is reserved. */
    kXBARA_InputDmaCh0Done          = 38|0x100U,   /**< DMA channel 0 done output assigned to XBARA_IN38 input. */
    kXBARA_InputDmaCh1Done          = 39|0x100U,   /**< DMA channel 1 done output assigned to XBARA_IN39 input. */
    kXBARA_InputDmaCh6Done          = 40|0x100U,   /**< DMA channel 6 done output assigned to XBARA_IN40 input. */
    kXBARA_InputDmaCh7Done          = 41|0x100U,   /**< DMA channel 7 done output assigned to XBARA_IN41 input. */
    kXBARA_InputPitTrigger0         = 42|0x100U,   /**< PIT trigger 0 output assigned to XBARA_IN42 input. */
    kXBARA_InputPitTrigger1         = 43|0x100U,   /**< PIT trigger 1 output assigned to XBARA_IN43 input. */
    kXBARA_InputRESERVED44          = 44|0x100U,   /**< XBARA_IN44 input is reserved. */
    kXBARA_InputEnc0CmpPosMatch     = 45|0x100U,   /**< ENC0 compare trigger and position match output assigned to XBARA_IN45 input. */
    kXBARA_InputAndOrInvert0        = 46|0x100U,   /**< AOI output 0 output assigned to XBARA_IN46 input. */
    kXBARA_InputAndOrInvert1        = 47|0x100U,   /**< AOI output 1 output assigned to XBARA_IN47 input. */
    kXBARA_InputAndOrInvert2        = 48|0x100U,   /**< AOI output 2 output assigned to XBARA_IN48 input. */
    kXBARA_InputAndOrInvert3        = 49|0x100U,   /**< AOI output 3 output assigned to XBARA_IN49 input. */
    kXBARA_InputPitTrigger2         = 50|0x100U,   /**< PIT trigger 2 output assigned to XBARA_IN50 input. */
    kXBARA_InputPitTrigger3         = 51|0x100U,   /**< PIT trigger 3 output assigned to XBARA_IN51 input. */
    kXBARB_InputCmp0Output          = 0|0x200U,    /**< CMP0 Output output assigned to XBARB_IN0 input. */
    kXBARB_InputCmp1Output          = 1|0x200U,    /**< CMP1 Output output assigned to XBARB_IN1 input. */
    kXBARB_InputCmp2Output          = 2|0x200U,    /**< CMP2 Output output assigned to XBARB_IN2 input. */
    kXBARB_InputCmp3Output          = 3|0x200U,    /**< CMP3 Output output assigned to XBARB_IN3 input. */
    kXBARB_InputRESERVED4           = 4|0x200U,    /**< XBARB_IN4 input is reserved. */
    kXBARB_InputRESERVED5           = 5|0x200U,    /**< XBARB_IN5 input is reserved. */
    kXBARB_InputRESERVED6           = 6|0x200U,    /**< XBARB_IN6 input is reserved. */
    kXBARB_InputRESERVED7           = 7|0x200U,    /**< XBARB_IN7 input is reserved. */
    kXBARB_InputPwm0Trg0OrPwm0Trg1  = 8|0x200U,    /**< PWMA channel 0 trigger 0 or  trigger 1 output assigned to XBARB_IN8 input. */
    kXBARB_InputPwm1Trg0OrPwm1Trg1  = 9|0x200U,    /**< PWMA channel 1 trigger 0 or  trigger 1 output assigned to XBARB_IN9 input. */
    kXBARB_InputPwm2Trg0OrPwm2Trg1  = 10|0x200U,   /**< PWMA channel 2 trigger 0 or  trigger 1 output assigned to XBARB_IN10 input. */
    kXBARB_InputPwm3Trg0OrPwm3Trg1  = 11|0x200U,   /**< PWMA channel 3 trigger 0 or  trigger 1 output assigned to XBARB_IN11 input. */
    kXBARB_InputPdb0Ch0Output       = 12|0x200U,   /**< PDB0 channel 0 output trigger output assigned to XBARB_IN12 input. */
    kXBARB_InputAdcAEs              = 13|0x200U,   /**< ADC converter A end of scan output assigned to XBARB_IN13 input. */
    kXBARB_InputXbarIn2             = 14|0x200U,   /**< XBARIN2 input pin output assigned to XBARB_IN14 input. */
    kXBARB_InputXbarIn3             = 15|0x200U,   /**< XBARIN3 input pin output assigned to XBARB_IN15 input. */
    kXBARB_InputRESERVED16          = 16|0x200U,   /**< XBARB_IN16 input is reserved. */
    kXBARB_InputRESERVED17          = 17|0x200U,   /**< XBARB_IN17 input is reserved. */
    kXBARB_InputDmaCh0Done          = 18|0x200U,   /**< DMA channel 0 done output assigned to XBARB_IN18 input. */
    kXBARB_InputDmaCh1Done          = 19|0x200U,   /**< DMA channel 1 done output assigned to XBARB_IN19 input. */
    kXBARB_InputXbarIn10            = 20|0x200U,   /**< XBARIN10 input pin output assigned to XBARB_IN20 input. */
    kXBARB_InputXbarIn11            = 21|0x200U,   /**< XBARIN11 input pin output assigned to XBARB_IN21 input. */
    kXBARB_InputDmaCh6Done          = 22|0x200U,   /**< DMA channel 6 done output assigned to XBARB_IN22 input. */
    kXBARB_InputDmaCh7Done          = 23|0x200U,   /**< DMA channel 7 done output assigned to XBARB_IN23 input. */
    kXBARB_InputPitTrigger0         = 24|0x200U,   /**< PIT trigger 0 output assigned to XBARB_IN24 input. */
    kXBARB_InputPitTrigger1         = 25|0x200U,   /**< PIT trigger 1 output assigned to XBARB_IN25 input. */
    kXBARB_InputPdb1Ch0Output       = 26|0x200U,   /**< PDB1 channel 0 output trigger output assigned to XBARB_IN26 input. */
    kXBARB_InputAdcBEs              = 27|0x200U,   /**< ADC converter B end of scan output assigned to XBARB_IN27 input. */
} xbar_input_signal_t;

