hparracho/Xarmlib/external/FSL/fsl_mkv44f16_cmsis.h
typedef enum _xbar_output_signal
{
    kXBARA_OutputDmamux18           = 0|0x100U,    /**< XBARA_OUT0 output assigned to DMAMUX slot 18 */
    kXBARA_OutputDmamux19           = 1|0x100U,    /**< XBARA_OUT1 output assigned to DMAMUX slot 19 */
    kXBARA_OutputDmamux20           = 2|0x100U,    /**< XBARA_OUT2 output assigned to DMAMUX slot 20 */
    kXBARA_OutputDmamux21           = 3|0x100U,    /**< XBARA_OUT3 output assigned to DMAMUX slot 21 */
    kXBARA_OutputXbOut4             = 4|0x100U,    /**< XBARA_OUT4 output assigned to XBAROUT4 output pin */
    kXBARA_OutputXbOut5             = 5|0x100U,    /**< XBARA_OUT5 output assigned to XBAROUT5 output pin */
    kXBARA_OutputXbOut6             = 6|0x100U,    /**< XBARA_OUT6 output assigned to XBAROUT6 output pin */
    kXBARA_OutputXbOut7             = 7|0x100U,    /**< XBARA_OUT7 output assigned to XBAROUT7 output pin */
    kXBARA_OutputXbOut8             = 8|0x100U,    /**< XBARA_OUT8 output assigned to XBAROUT8 output pin */
    kXBARA_OutputXbOut9             = 9|0x100U,    /**< XBARA_OUT9 output assigned to XBAROUT9 output pin */
    kXBARA_OutputXbOut10            = 10|0x100U,   /**< XBARA_OUT10 output assigned to XBAROUT10 output pin */
    kXBARA_OutputXbOut11            = 11|0x100U,   /**< XBARA_OUT11 output assigned to XBAROUT11 output pin */
    kXBARA_OutputAdcaTrig           = 12|0x100U,   /**< XBARA_OUT12 output assigned to ADC converter A trigger */
    kXBARA_OutputAdcbTrig           = 13|0x100U,   /**< XBARA_OUT13 output assigned to ADC converter B trigger */
    kXBARA_OutputRESERVED14         = 14|0x100U,   /**< XBARA_OUT14 output is reserved. */
    kXBARA_OutputDac012bSync        = 15|0x100U,   /**< XBARA_OUT15 output assigned to DAC0 synchronisation trigger */
    kXBARA_OutputCmp0               = 16|0x100U,   /**< XBARA_OUT16 output assigned to CMP0 window/sample */
    kXBARA_OutputCmp1               = 17|0x100U,   /**< XBARA_OUT17 output assigned to CMP1 window/sample */
    kXBARA_OutputCmp2               = 18|0x100U,   /**< XBARA_OUT18 output assigned to CMP2 window/sample */
    kXBARA_OutputCmp3               = 19|0x100U,   /**< XBARA_OUT19 output assigned to CMP3 window/sample */
    kXBARA_OutputPwmA0ExtA          = 20|0x100U,   /**< XBARA_OUT20 output assigned to PWMA channel 0 external control A */
    kXBARA_OutputPwmA1ExtA          = 21|0x100U,   /**< XBARA_OUT21 output assigned to PWMA channel 1 external control A */
    kXBARA_OutputPwmA2ExtA          = 22|0x100U,   /**< XBARA_OUT22 output assigned to PWMA channel 2 external control A */
    kXBARA_OutputPwmA3ExtA          = 23|0x100U,   /**< XBARA_OUT23 output assigned to PWMA channel 3 external control A */
    kXBARA_OutputPwmA0ExtSync       = 24|0x100U,   /**< XBARA_OUT24 output assigned to PWMA channel 0 external synchronization */
    kXBARA_OutputPwmA1ExtSync       = 25|0x100U,   /**< XBARA_OUT25 output assigned to PWMA channel 1 external synchronization */
    kXBARA_OutputPwmA2ExtSync       = 26|0x100U,   /**< XBARA_OUT26 output assigned to PWMA channel 2 external synchronization */
    kXBARA_OutputPwmA3ExtSync       = 27|0x100U,   /**< XBARA_OUT27 output assigned to PWMA channel 3 external synchronization */
    kXBARA_OutputPwmAExtClk         = 28|0x100U,   /**< XBARA_OUT28 output assigned to PWMA external clock */
    kXBARA_OutputPwmAFault0         = 29|0x100U,   /**< XBARA_OUT29 output assigned to PWMA fault 0 */
    kXBARA_OutputPwmAFault1         = 30|0x100U,   /**< XBARA_OUT30 output assigned to PWMA fault 1 */
    kXBARA_OutputPwmAFault2         = 31|0x100U,   /**< XBARA_OUT31 output assigned to PWMA fault 2 */
    kXBARA_OutputPwmAFault3         = 32|0x100U,   /**< XBARA_OUT32 output assigned to PWMA fault 3 */
    kXBARA_OutputPwmAForce          = 33|0x100U,   /**< XBARA_OUT33 output assigned to PWMA external output force */
    kXBARA_OutputRESERVED34         = 34|0x100U,   /**< XBARA_OUT34 output is reserved. */
    kXBARA_OutputRESERVED35         = 35|0x100U,   /**< XBARA_OUT35 output is reserved. */
    kXBARA_OutputRESERVED36         = 36|0x100U,   /**< XBARA_OUT36 output is reserved. */
    kXBARA_OutputRESERVED37         = 37|0x100U,   /**< XBARA_OUT37 output is reserved. */
    kXBARA_OutputPdb0InCh12         = 38|0x100U,   /**< XBARA_OUT38 output assigned to PDB0 trigger option 12 */
    kXBARA_OutputRESERVED39         = 39|0x100U,   /**< XBARA_OUT39 output is reserved. */
    kXBARA_OutputRESERVED40         = 40|0x100U,   /**< XBARA_OUT40 output is reserved. */
    kXBARA_OutputPdb1InCh12         = 41|0x100U,   /**< XBARA_OUT41 output assigned to PDB1 trigger option 12 */
    kXBARA_OutputRESERVED42         = 42|0x100U,   /**< XBARA_OUT42 output is reserved. */
    kXBARA_OutputRESERVED43         = 43|0x100U,   /**< XBARA_OUT43 output is reserved. */
    kXBARA_OutputEnc0PhA            = 44|0x100U,   /**< XBARA_OUT44 output assigned to ENC0 quadrature waveform phase A */
    kXBARA_OutputEnc0PhB            = 45|0x100U,   /**< XBARA_OUT45 output assigned to ENC0 quadrature waveform phase B */
    kXBARA_OutputEnc0Index          = 46|0x100U,   /**< XBARA_OUT46 output assigned to ENC0 refresh/reload */
    kXBARA_OutputEnc0Home           = 47|0x100U,   /**< XBARA_OUT47 output assigned to ENC0 home position */
    kXBARA_OutputEnc0CapTrigger     = 48|0x100U,   /**< XBARA_OUT48 output assigned to ENC0 clear/snapshot */
    kXBARA_OutputRESERVED49         = 49|0x100U,   /**< XBARA_OUT49 output is reserved. */
    kXBARA_OutputRESERVED50         = 50|0x100U,   /**< XBARA_OUT50 output is reserved. */
    kXBARA_OutputRESERVED51         = 51|0x100U,   /**< XBARA_OUT51 output is reserved. */
    kXBARA_OutputRESERVED52         = 52|0x100U,   /**< XBARA_OUT52 output is reserved. */
    kXBARA_OutputRESERVED53         = 53|0x100U,   /**< XBARA_OUT53 output is reserved. */
    kXBARA_OutputRESERVED54         = 54|0x100U,   /**< XBARA_OUT54 output is reserved. */
    kXBARA_OutputRESERVED55         = 55|0x100U,   /**< XBARA_OUT55 output is reserved. */
    kXBARA_OutputRESERVED56         = 56|0x100U,   /**< XBARA_OUT56 output is reserved. */
    kXBARA_OutputRESERVED57         = 57|0x100U,   /**< XBARA_OUT57 output is reserved. */
    kXBARA_OutputEwmIn              = 58|0x100U,   /**< XBARA_OUT58 output assigned to EWM input */
    kXBARB_OutputAoiIn0             = 0|0x200U,    /**< XBARB_OUT0 output assigned to AOI input0 */
    kXBARB_OutputAoiIn1             = 1|0x200U,    /**< XBARB_OUT1 output assigned to AOI input1 */
    kXBARB_OutputAoiIn2             = 2|0x200U,    /**< XBARB_OUT2 output assigned to AOI input2 */
    kXBARB_OutputAoiIn3             = 3|0x200U,    /**< XBARB_OUT3 output assigned to AOI input3 */
    kXBARB_OutputAoiIn4             = 4|0x200U,    /**< XBARB_OUT4 output assigned to AOI input4 */
    kXBARB_OutputAoiIn5             = 5|0x200U,    /**< XBARB_OUT5 output assigned to AOI input5 */
    kXBARB_OutputAoiIn6             = 6|0x200U,    /**< XBARB_OUT6 output assigned to AOI input6 */
    kXBARB_OutputAoiIn7             = 7|0x200U,    /**< XBARB_OUT7 output assigned to AOI input7 */
    kXBARB_OutputAoiIn8             = 8|0x200U,    /**< XBARB_OUT8 output assigned to AOI input8 */
    kXBARB_OutputAoiIn9             = 9|0x200U,    /**< XBARB_OUT9 output assigned to AOI input9 */
    kXBARB_OutputAoiIn10            = 10|0x200U,   /**< XBARB_OUT10 output assigned to AOI input10 */
    kXBARB_OutputAoiIn11            = 11|0x200U,   /**< XBARB_OUT11 output assigned to AOI input11 */
    kXBARB_OutputAoiIn12            = 12|0x200U,   /**< XBARB_OUT12 output assigned to AOI input12 */
    kXBARB_OutputAoiIn13            = 13|0x200U,   /**< XBARB_OUT13 output assigned to AOI input13 */
    kXBARB_OutputAoiIn14            = 14|0x200U,   /**< XBARB_OUT14 output assigned to AOI input14 */
    kXBARB_OutputAoiIn15            = 15|0x200U,   /**< XBARB_OUT15 output assigned to AOI input15 */
} xbar_output_signal_t;


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


